{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "name": "conv2d_1", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "batch_input_shape": [null, 128, 128, 3], "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 96, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 160, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 192, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 218, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "strides": [1, 1], "filters": 282, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"units": 5, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null}}]}