{"config": [{"config": {"activation": "relu", "dilation_rate": [1, 1], "batch_input_shape": [null, 128, 128, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 32, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "dtype": "float32", "name": "conv2d_1", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_1", "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 96, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_4", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 160, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_5", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 192, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_6", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_4", "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [2, 2], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 218, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_7", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "kernel_size": [2, 2], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 256, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "conv2d_8", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "bias_constraint": null, "units": 128}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_2", "bias_constraint": null, "units": 5}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}